{
  "remove_space": false,
  "do_lower_case": false,
  "tokenizer_class": "QWenTokenizer",
  "auto_map": {
    "AutoTokenizer": [
      "tokenization_qwen.QWenTokenizer",
      null
      ]
  },
  "bos_token": {
      "__type": "AddedToken",
      "content": "<|im_start|>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false
    },
  "eos_token": {
    "__type": "AddedToken",
    "content": "<|im_end|>",
    "lstrip": false,
    "normalized": true,
    "rstrip": false,
    "single_word": false
  }
}
