{
  "model_name_or_path": "sunzeyeah/glm-350M-chinese",
  "architectures": [
    "GLMModel"
  ],
  "attention_dropout_prob": 0.1,
  "attention_scale": 1.0,
  "auto_map": {
    "AutoConfig": "configuration_glm.GLMConfig",
    "AutoModel": "modeling_glm.GLMModel",
    "AutoModelForSeq2SeqLM": "modeling_glm.GLMForConditionalGeneration",
    "AutoModelForMultipleChoice": "modeling_glm.GLMForMultipleChoice"
    },
  "block_position_encoding": true,
  "checkpoint_activations": false,
  "checkpoint_num_layers": 1,
  "embedding_dropout_prob": 0.1,
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "max_sequence_length": 1024,
  "model_type": "glm",
  "num_attention_heads": 16,
  "num_layers": 24,
  "output_dropout_prob": 0.1,
  "output_predict": true,
  "parallel_output": true,
  "pool_token": "cls",
  "relative_encoding": false,
  "spell_func": "lstm",
  "spell_length": null,
  "torch_dtype": "float32",
  "vocab_size": 50048,
  "pad_token_id": 50000
}